Revit 2026 API

# ImagePlacementOptions Properties

---

The ImagePlacementOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Location | The location in the model where a point of the ImageInstance, determined by the PlacementPoint property, is going to be inserted. |
|  | PlacementPoint | Identifies which point of the ImageInstance will be aligned to the Location |

#### Reference

ImagePlacementOptions Class

Autodesk.Revit.DB Namespace